[
  {
    "id": "4",
    "name": "TWO BROTHERS & ONE LUMBO",
    "description": "Brings together a selection of works that tackle the socio-political landscape of Nigeria thus generating a visual representation of the numerous opinions and questions presented at a critical period such as this in our country’s framework. It explores the use of satire as a literary device to concretize the mental picture of where we stand as a nation albeit the future expectations from the forthcoming elections.  It marries the display of art in a traditional gallery setting with the fast evolving technology of Art NFT and how it is displayed and interacted with as different methods of expression. This union is the crux of the exhibition. Which is why all the traditionally created NFTs being exhibited will come with the original physical versions when they’re collected.  This births the question of how Art and Technology can be used as effective tools of influencing social/political change in such an environment as Nigeria where technology and art are still mostly dealt the unimportant hand.",
    "cover_image": "https://media.publit.io/file/4-2l.png",
    "images": "https://media.publit.io/file/1-31-wj.jpg,https://media.publit.io/file/1-56-r.jpg,https://media.publit.io/file/1-21-c.jpg,https://media.publit.io/file/1-62-h.jpg,https://media.publit.io/file/1-37-g.jpg,https://media.publit.io/file/1-32-m.jpg,https://media.publit.io/file/1-6-w.jpg,https://media.publit.io/file/1-36-Z.jpg",
    "type": "Hybrid",
    "link": "https://www.spatial.io/s/Two-Brothers-and-One-Lumbo-63514a264050e10001cf2885?share=2770796175722438902",
    "is_featured": "1",
    "is_done": "1",
    "created_at": "2023-08-05 18:02:19",
    "updated_at": "2023-08-05 18:02:19",
    "thumbnails": "https://media.publit.io/file/Screenshot-2023-09-12-at-16.35.45.png",
    "date": "5 - 7th August 2022"
  },
  {
    "id": "6",
    "name": "Cigarette Stories",
    "description": "Cigarette Stories is a captivating photography collection that immerses viewers in the complex world of smoking. Through a series of powerful visuals, it offers a thought-provoking exploration of the various facets of smoking.",
    "cover_image": "https://media.publit.io/file/CigaretteStories/Cigarette-Stories.jpg",
    "images": "https://media.publit.io/file/CigaretteStories/Cigarette-Stories.jpg",
    "type": "Virtual",
    "link": "none",
    "is_featured": "1",
    "is_done": "1",
    "created_at": "2024-02-06 10:12:44",
    "updated_at": "2024-02-06 10:12:44",
    "thumbnails": null,
    "date": null
  },
  {
    "id": "7",
    "name": "Emerging Expressions",
    "description": "Embarking on a visual odyssey, this exhibition unveils the boundless creativity of undergraduate artists from Nigerian universities. Within the confines of their academic pursuits, these emerging visionaries defy convention, seeking to etch an indelible mark upon the canvas of the art industry.\n\n Through a kaleidoscope of mediums and untethered expressions, they navigate the intersection of tradition and innovation. In each stroke and pixel, a narrative unfolds — a testament to their journey in establishing an artistic identity. With unwavering determination, these artists illuminate the gallery space inviting viewers to witness the evolution of a new wave in Nigerian art. \n\nEmbracing the spirit of Zaria rebels, Nsukka, Yaba, and Auchi art schools, our exhibition celebrates a transformative juncture in art sales via blockchain innovation. \n\nUndergraduate artists across Nigerian universities converge to redefine the traditional art market. Infusing their diverse narratives and techniques, they challenge established norms with a revolutionary approach.\n\nThis showcase not only captures the essence of academic institutions like Zaria, Nsukka, Yaba, and co but also propels their influence into the digital era and a proclamation of resilience, talent, and the relentless pursuit of making an enduring mark in the ever-evolving tapestry of the art world through blockchain and navigating  decentralized landscapes that foster direct connections between artists and patrons. \n\nThe exhibition serves as a testament to the evolving synergy between art and technology, marking a pivotal moment where the vibrant legacy of Nigerian art schools intersects with the cutting-edge possibilities of blockchain, creating a dynamic marketplace for the future\n\n--Fab-Uche Valerie \nCurator\n",
    "cover_image": "https://media.publit.io/file/Resize-banner.webp",
    "images": "https://media.publit.io/file/Poster-Resize.png",
    "type": "Physical",
    "link": "https://emergingexpressions.art/",
    "is_featured": "1",
    "is_done": "1",
    "created_at": "2024-03-22 07:03:32",
    "updated_at": "2024-03-22 07:03:32",
    "thumbnails": null,
    "date": null
  },
  {
    "id": "8",
    "name": "Ifebube",
    "description": "Ifebube showcases Chuma Anagbado's recent experimental works, reflecting his extensive journey to blend his line drawings, cultural heritage, and passion for technology. This exhibition marks the artist's third solo exhibition.  Anagbado's transition from a career in advertising back to visual art has led to his innovative use of advanced tools and machines. His academic background as a sculptor, with a bachelor's degree from the University of Benin (class of 2005) and a master's degree in Design from the University of Creative Arts, Rochester, United Kingdom, merges with his interest in technological advancements. This combination results in unique pieces that feature Igbo traditional ideologies, elements, and imagery. This exhibition features a mix of Anagbado's earlier hand-drawn pieces alongside his latest works, where he abandons conventional tools like pens and chisels for laser lights. Additionally, he incorporates acrylic paints to add colour to selected areas in his palaeography works, evoking emotions and the desire for the viewers to imagine filling the unpainted areas.   This exhibition also includes digital blockchain versions of the original palaeography drawings in black and white, creating a portal between the physical object and further information about the work when the QR code embedded in each piece is activated. The gene-like, interwoven lyrical lines shown in the piece are offshoots of Uli drawing. Uli is an indigenous Igbo art form drawn on the body and wall for decoration, which was brought into modern African art by Uche Okeke in the 60s and has continued to undergo different transformations in the hands of contemporary Igbo artists such as Obiora Udechukwu, Tayo Adenaike, Chijioke Onuora, Igbobinna Eze among others who still see the need for its continued relevance in the timeline of African art history.   The poetic nature of these gene-like lines invites viewers to ponder the transmission of cultural ideas, processes, and elements across generations. The exhibition's title, Ifebube, is derived from the name of Anagbado's mother, Esther Ifebube, who passed away on July 5, 1999. The term Ifebube alludes to the mysterious and profound appearance of the works and their capacity to exist across various realms of understanding and communication.  Through this exhibition, Chuma Anagbado offers a compelling exploration that bridges the past and present. He fulfils his desire to record and celebrate Igbo culture and ideologies, creating a sense of awe and wonder.",
    "cover_image": "https://media.publit.io/file/Ifebube.webp",
    "images": "https://media.publit.io/file/IMG-2916-6.webp",
    "type": "Physical",
    "link": "https://shorturl.at/wpxH7",
    "is_featured": "0",
    "is_done": "1",
    "created_at": "2024-05-30 07:23:18",
    "updated_at": "2024-05-30 07:23:18",
    "thumbnails": null,
    "date": null
  },
  {
    "id": "9",
    "name": "Artist Commune",
    "description": "At The Artists Commune exhibition, we celebrate the power of diversity in artistic expression by showcasing a wide range of talents, from emerging visual artists to well-known figures in the art world. Our commitment to promoting lesser-known artists alongside established ones reflects our belief in the importance of supporting and uplifting voices that might otherwise go unheard.\n\nIn addition to traditional art media, The Artists Commune embraces the digital space as a vital and cutting-edge form of artistic exploration. By bridging the gap between physical and digital art, we aim to highlight the innovative ways in which artists are pushing boundaries and redefining the art landscape.\n\nThrough this inclusive approach, The Artists Commune seeks to create a vibrant and dynamic platform where artists from all backgrounds can come together, inspire one another, and foster a sense of community and collaboration. We invite you to join us on this journey of discovery and celebrate the endless possibilities of artistic expression.",
    "cover_image": "https://media.publit.io/file/Artist-Commune.png",
    "images": "https://media.publit.io/file/Artist-Commune.png",
    "type": "Physical",
    "link": "https://tix.africa/discover/tcommune",
    "is_featured": "0",
    "is_done": "1",
    "created_at": "2024-06-08 06:03:51",
    "updated_at": "2024-06-08 06:03:51",
    "thumbnails": null,
    "date": null
  }
]
